var array = [{"Tweet":"@FoxNews#election results. Now how to get our Government and our Current President Obama to hold true the outcome. This is the voter choice!","ratings":1.0},{"Tweet":"#ObamaLegacy David Bowie Vinyl Decal Bumper Sticker Anonymous #DavidBowie  #sgp #CTL #BLM #obama https://t.co/UXxZguJ80W","ratings":1.0},{"Tweet":"On farewell interview tour, Obama will get candid on race https://t.co/LMmTh27r2b","ratings":1.0},{"Tweet":"@IHWCo This reporter has a very good point, why didn't the US impose new sanctions on Iran re:Syria https://t.co/hhaTX6xBQz","ratings":1.0},{"Tweet":"@Kevin_McCashion The Obama Administration, what went wrong? https://t.co/EuVYUuSayG","ratings":-1.0},{"Tweet":"Hell to tha YES!!! 🎉🎉🎉🎉🇺🇸🇺🇸🇺🇸 https://t.co/iSgNHHt4ZK","ratings":-1.0},{"Tweet":"@transveado somehow I read this as obama watch yuri on ice","ratings":-1.0},{"Tweet":"#Obama refuses to sign #Iran sanctions bill https://t.co/VZevvId6Q2","ratings":-1.0},{"Tweet":"@foxnation @FoxNews all Obama and Hillary's doing!","ratings":-1.0},{"Tweet":"Who's RESPONSIBLE for U S security? Who is really the blame. Not Russia, OR China OR Israel, OR North Korea,OR Iran… https://t.co/j1mHtZMQDS","ratings":1.0},{"Tweet":"Rickards: Obama’s blunder; Trump’s gambit - https://t.co/bmhoLVNKda","ratings":-1.0},{"Tweet":"Donald Trump Fires Back At Obama For Trying To Delegitimize His Win https://t.co/WG2QHOjIav","ratings":1.0},{"Tweet":"Heres why a place of the coals on offensive against Obama","ratings":-1.0},{"Tweet":"Yuck and Americans like me can't even afford to go on a vacation. https://t.co/IgwKS7amPx","ratings":1.0},{"Tweet":"#Obama cabinet by far more well educated and qualified than #tRump and his picks https://t.co/LMxD57q7Qk","ratings":1.0},{"Tweet":"College president blames election outcome on racism against Obama https://t.co/i8MTATzsfX https://t.co/yc0kOYNY3H","ratings":-1.0},{"Tweet":"#black cock anal video obama sex change https://t.co/wgOtyCb8JJ","ratings":1.0},{"Tweet":"@7thtemplar @BrittPettibone Nope. Hillary + Obama want it to be Russia. However, they're mad at who released true agenda + attitude. We","ratings":-1.0},{"Tweet":"You were very much smarter than her and Obama.","ratings":-1.0},{"Tweet":"@PressSec Obama puppet and twerp Josh Earnest, is the biggest toolbox in Washington next to Husain Obama. #TrumpWonYouLost #MAGA","ratings":-1.0},{"Tweet":"@WSJ Maybe we should take some focus off of Russia and think about what Iran's real intentions might be. At least no veto from Mr. Obama.","ratings":1.0},{"Tweet":"Farewell Obama... Get a copy of a book by my very good friend @BArogundade: 101 Best Ever Obama magazine covers https://t.co/sE2ha2INP3","ratings":1.0},{"Tweet":"To be honest how many conflicts are there? He has nothing to offer but conflict yet he still in the office. Obama,… https://t.co/uV0j3Wtc3H","ratings":1.0},{"Tweet":"College president blames election outcome on ‘racism’ against Obama https://t.co/DuGYciNAm5","ratings":1.0},{"Tweet":"44 days left until Trump takes office.Tell Pres Obama to flex his executive muscle and do something Trump can't undo https://t.co/eEud1OaySe","ratings":1.0},{"Tweet":"@rmdeco54 @nanzastl @WWEJeddah @Piccadillio « ignorant. Obama wasn't accused of not being a citizen because of his race. It's because his »","ratings":-1.0},{"Tweet":"@Zipperedlips Obama can suck it, he could have had it in 2008 and didn't do it with a D House and Senate.","ratings":1.0},{"Tweet":"📷 president obama with   small  kids  https://t.co/L2O8PIhguR","ratings":1.0},{"Tweet":"@Pahblowe Obama endured that lie w/ grace while the crybaby in chief can't handle the truth.","ratings":-1.0},{"Tweet":"@gokells21 @brozlofsky what's funny is, why was Obama picked over her then in 08? Dena are such sexists!","ratings":-1.0},{"Tweet":"Anti-Ru rhetoric has been strong under Obama. Add US military escalation surrounding Ru & saying a leak is Ru hack fits propaganda effort.","ratings":1.0},{"Tweet":"The more I see his tweets, the more I LOOOOVE Malik Obama","ratings":1.0},{"Tweet":"Michelle Obama to host special 'Hidden Figures' screening at the White House. Can we get two tickets and a popcorn?… https://t.co/ur6K5KpyUR","ratings":1.0},{"Tweet":"Young Barack Obama struggles with identity in 'Barry' clip https://t.co/4UH19ZmFkg #Celebrity #Movies https://t.co/ZXxBjuTWkU","ratings":1.0},{"Tweet":"With WH press sec Josh Earnest openly accusing Trump conspiring w/ Putin Obama can kiss any chance of saving some of his Exec Orders goodbye","ratings":1.0},{"Tweet":"Bill O’Reilly On Media Meltdown 2016, Obama’s Legacy &; Fox News Changes https://t.co/wZ2BStmUVg via @deadline","ratings":-1.0},{"Tweet":"@washingtonpost @PressSec @POTUS: Just remember any #RussiaHacking is under Obama's watch!\n\n#Hypocrite #ObamaLegacy #HappeningNow","ratings":1.0},{"Tweet":"@LouDobbs @tony4ny Obama created GOVERNMENT Jobs. Texas created REAL jobs! #TexasStrong","ratings":-1.0},{"Tweet":"After Raising Rates Once During The Obama Years, The Fed Promises Constant Rate Hikes During The Trump Era https://t.co/JDWeuRJ58H","ratings":1.0},{"Tweet":"@finneyk @NBCNews who cares just stop reporting this Obama's not going to do nothing about it or congress we're stuck with this fuck face","ratings":-1.0},{"Tweet":"@thehill The use of facts has not stopped the Obama Administration from falling to stop IsIs from being a world wide threat.","ratings":-1.0},{"Tweet":"Obama is by all Standards the WORST PRESIDENT IN US HISTORY! A President take the Oath of Office to UPHOLD THE CONS… https://t.co/4bxMlWcmAf","ratings":1.0},{"Tweet":"@marylovefreedom most of the stuff you write is pretty good, and there is a lot to criticize Obama on, but he took relatively few Vaca days","ratings":1.0},{"Tweet":"#ChristmasIdeas 🎄🐸 Anti Liberal MICHELLE OBAMA IMMIGRANT TAKING MY JOB Conservative Political Shirt https://t.co/v5PUOlwnSv","ratings":1.0},{"Tweet":"Pure lack of leadership! The world has known for 7.5 years! Power up! https://t.co/h4TJoFpehW","ratings":1.0},{"Tweet":"Putin would rather have Hillary, she is easy - she follows Obama around with a leash.","ratings":-1.0},{"Tweet":"@America_Now @FoxNews @realDonaldTrump so the RNC GOP gave a beautiful red carpet for obama to run for the last 8yrs lol short term memory","ratings":1.0},{"Tweet":"If that's the case for \"advancements\" Obama has made, then yes, I am glad that Trump will destroy the advances of t… https://t.co/hdtWUfZrce","ratings":1.0},{"Tweet":"Obama requested Congressional GOP to participate, they refused. So Dems did it w/o them. But who cares about the fa… https://t.co/liBzQW3A6P","ratings":-1.0},{"Tweet":"@AP What Dems Phony Cold War about-covering Obama GIVEAWAY of world influence 2 Putin as Assad,Putin DESTROY Aleppo, MORE refugees 4 West!","ratings":1.0},{"Tweet":"@cmichaeld2004 @realDonaldTrump obama is behind it u can bet on it if u were russia who would u rather deal with cmo  whole thing is fake","ratings":1.0},{"Tweet":"Well said!  They all need to put on their big people pants suck it up and deal with it! https://t.co/2wN99ZyBJB","ratings":-1.0},{"Tweet":"To VP Biden - gather senators just before Jan. 20 and confirm Pres. Obama choice for SCOTUS - I strongly recomment this and it can be done.","ratings":1.0},{"Tweet":"@TheEconomist Obama's Red Line. SMH","ratings":-1.0},{"Tweet":"Obama administration denies mining lease renewal near Boundary Waters wilderness in Minnesota https://t.co/uJUecjMQxW","ratings":-1.0},{"Tweet":"@HispanicsTrump this is too obvious. 500 billion deal between Exxon and Russia that Obama blocked,and now CEO of Exxon is secretary of state","ratings":1.0},{"Tweet":"I added a video to a @YouTube playlist https://t.co/ukSwyLD4bc Ben Shapiro lists the crimes of the Obama Administration","ratings":-1.0},{"Tweet":"Remember when the Republicans were saying Putin was playing chess and Obama was playing checkers??? https://t.co/EufRgsovyL","ratings":-1.0},{"Tweet":"Turkey's Erdogan says discussed Syria, Iraq with Obama https://t.co/S6Q9O0Zon1 #iraq #iraqi","ratings":-1.0},{"Tweet":"False choice. In 2012, non-college educated whites made up 1/3 of Obama's coalition (h/t @Nate_Cohn) https://t.co/SjeG7l5URy","ratings":-1.0},{"Tweet":"@Felonious_P hey man, I read the article. Argues Obama should have done more in Syria. How is being overly cautious a scandal?","ratings":1.0},{"Tweet":"@newtgingrich @PJK4brainhealth you need to stop PROP and do away with Obama's lackeys that put us in the same boat as opioid addicts.","ratings":1.0},{"Tweet":"Trump: It Sure Is Interesting The Obama Admin. Only Became Concerned About Russian Hacking After Hillary Lost |  https://t.co/FAzSlsoIRa","ratings":-1.0},{"Tweet":"#Obama Continues Weaseling All The Way To End\n\n https://t.co/i3JASaZyu6\n\n #RT #News #Free #Jobs #Win #Hiring #PTL @realDonaldTrump","ratings":-1.0},{"Tweet":"@Mike_Beacham @AmerPride777 I'm glad we will get rid of this infant genocide.Obama is the most rabidly pro-abortion pres in history. #legacy","ratings":-1.0},{"Tweet":"Sheriff Joe Arpaio resurfaces investigation into @barackObama citizenship https://t.co/eSTFpkOrYn \"It's About FORGED DOCUMENTS!\"","ratings":1.0},{"Tweet":"Here's the complete answer your questions Obama INELIGIBLE; And you'll see the timing of these just past elections… https://t.co/NKhUYTZywD","ratings":1.0},{"Tweet":"@DrMartyFox Obama: \"Tell Putin I will be more flexible after the election.\" @SusanSpurgeon1","ratings":1.0},{"Tweet":"@KellyannePolls\n@newtgingrich\n@seanhannity \nIf Russian claws dug into US politics, Obama — not Trump — let it happen\nhttps://t.co/Fbenp8RMhT","ratings":1.0},{"Tweet":"Republicans worry about party amid planned vote in Jan. to dismantle Obama health care law https://t.co/lcAGbo7cwj https://t.co/exI11DrwyD","ratings":-1.0},{"Tweet":"@Marjee123 @funder Trump isn't in office but your blaming him 4what Obama started and hasn't finished, why I'm XDemocrat,","ratings":1.0},{"Tweet":"Two faced https://t.co/dR4YkRlvUR","ratings":-1.0},{"Tweet":"sad and scary https://t.co/7RnVm5bBsr","ratings":-1.0},{"Tweet":"Chuck Hagel says it was a mistake for President Obama not to follow through on the red line he set on Syria https://t.co/jdSEeu4mbj","ratings":-1.0},{"Tweet":"Chuck Hagel says it was a mistake for President Obama not to follow through on the red line he set on Syria https://t.co/SbbYTe94uI","ratings":-1.0},{"Tweet":"Russians (or someone?? @TheDemocrats ?? ) hacked Obama's approval results #fakenews #MAGA #TrumpTrain https://t.co/Fyv8KzOqKn","ratings":1.0},{"Tweet":"Guess that wasn't soft selling. https://t.co/vm7LeLlN40","ratings":1.0},{"Tweet":"@RealTessStewart @TrojanRobDog  Did you stand against Obama? You can stand against anything you like. That's what's great about America","ratings":-1.0},{"Tweet":"Chuck Hagel says it was a mistake for President Obama not to follow through on the red line he set on Syria https://t.co/rB2fvXW4pO","ratings":-1.0},{"Tweet":"STARTS at the TOP! Detrimental POTUS! Detrimental Depts  all over t Obama Admin. @MauraMcC127 @MiddleEastGuy… https://t.co/W7ixCNYwqn","ratings":-1.0},{"Tweet":"And after them should come Obama and Clinton - yes liberals, your beloved dynamic duo are war criminals too","ratings":-1.0},{"Tweet":"@T_S_P_O_O_K_Y @megynkelly @USATODAY  Obama/hacks using misinformation campaign to damage US/russian relations, to effect mideast stability","ratings":-1.0},{"Tweet":"charlie is reading me a obama/biden fanfiction send help pls","ratings":1.0},{"Tweet":"GOOD OBAMA PUT THEM THERE I WANT OBAMA IN PRISON FOR TREASON THEN HANG THE SON OF A BITCH. https://t.co/fYkCHYdYP6","ratings":1.0},{"Tweet":"@jpodhoretz The Obama Administrtion, what went wrong? https://t.co/EuVYUuSayG","ratings":-1.0},{"Tweet":"The Obama Deception: The Mask Comes Off  (2013) (Documented Movie) It's all laid out-JFK was the last real Pres\nhttps://t.co/SbwSBw8OMQ","ratings":1.0},{"Tweet":"@thenateralph @WolfKaluaikuHI @PrisonPlanet  you mean like Obama with all of his executive orders?","ratings":-1.0},{"Tweet":"This should be Front Page News and Obama's Justice Department should be ALL over this---and they would be---if... https://t.co/T7JrA0kTPS","ratings":1.0},{"Tweet":"I'm saying that we should use laws first to prevent autocracy, to prevent our values being further corroded. https://t.co/tw0HdOLzQC","ratings":-1.0},{"Tweet":"@photosandbacon they must of left this in Obama's neighborhood","ratings":1.0},{"Tweet":"Praise God that #Trump will replace #Obama @POTUS, the biggest #LiarInChief EVER! Amen #MAGA #SCOTUS #1A #2A… https://t.co/ZFPCHsDADK","ratings":1.0},{"Tweet":"Obama Admits in Court - Birth Certificate Is Fake (Video) New David Vose Video Before Sheriff Joe Press Conference https://t.co/ElhqPqAWT4","ratings":-1.0},{"Tweet":"Time to belly up to bar boys.  No excuses.  No sanctuary from abortion: Obama to force states to fund Plnned hood https://t.co/ARRApIouqu","ratings":1.0},{"Tweet":"Just speculating & using past misdirection by Obama admin. https://t.co/kKDnKoVrGV","ratings":1.0},{"Tweet":"I wouldn't let my kids near her! https://t.co/5E7mbbV9Ss","ratings":-1.0},{"Tweet":"Team Trump blasts Obama White House over... https://t.co/WKODO0Eg79 via @msnbc https://t.co/ynN8qP45Cq","ratings":1.0},{"Tweet":"The Results of Obama's Red-Line Threat\nBolton:Aleppo Is Significant Victory 4Assad Regime~Russia &Ayatollahs in Iran https://t.co/4PWsjrDGlP","ratings":1.0},{"Tweet":"In 30 years all history books should have a chapter dedicated to Malik Obama and the Anti-Thot Movement","ratings":-1.0},{"Tweet":"Accountability And Irresponsibility: The Two Faces Of Obama's Higher Education Legacy https://t.co/EhlLHDvrDB","ratings":1.0},{"Tweet":"If you're walking down the right path and are willing to keep walking, eventually you'll make process -Barack Obama","ratings":1.0},{"Tweet":"College president blames election outcome on 'racism' against Obama - https://t.co/Xc3PScxqmh… https://t.co/ExIpxWCt9Q","ratings":1.0},{"Tweet":"@foxandfriends @rushlimbaugh Obama approved the sale of Uranium to Russia Obama used tax money to overthrow Israeli election Party of fraud","ratings":-1.0},{"Tweet":"Obama's Not Closing Guantanamo, He's Renovating It - https://t.co/WPjSQ82Yg1","ratings":-1.0},{"Tweet":"#entertainment Young Barack Obama struggles with identity in 'Barry' clip https://t.co/z6NPNy2fx7 https://t.co/R49ZIVI9nP","ratings":1.0},{"Tweet":"Obama Environmental Legacy at Stake as GOP, Industry Align https://t.co/d2GPjSzG8T","ratings":-1.0},{"Tweet":"It was a huge mistake, and will end up being remembered as a defining point of his Presidency. #Aleppo https://t.co/Fzvw1ltH6Q","ratings":-1.0},{"Tweet":"@discreetsecure Obama never even COMMENTS on interest rates, GDP, etc. Just trannies in Ladies Rooms. @gogotrump @JuddLegum","ratings":1.0},{"Tweet":"Aleppo challenges Obama's legacy https://t.co/souHba9yqc via @YahooNews","ratings":-1.0},{"Tweet":"Pres Obama was aware of this behavior. Vilsack should go to prison. Where is the money? About Sec. Tillerson being… https://t.co/9hTa6HrSye","ratings":-1.0},{"Tweet":"So in 2008 and 2012 we weren't racist, now we are???? Crazy!! https://t.co/bZ3pjKl5oE","ratings":-1.0},{"Tweet":"Obama's Last Days in Office are Spent 'Trump-Proofing' the Oval Office - Girls Just Wanna Have Guns https://t.co/HPfiJri0UA","ratings":1.0},{"Tweet":"#entertainment Young Barack Obama struggles with identity in 'Barry' clip https://t.co/2Z2nvhslSo https://t.co/1dYVrcIXmV","ratings":1.0},{"Tweet":"Turkey's Erdogan says discussed Syria, Iraq with Obama https://t.co/DNkkV4IUaM","ratings":-1.0},{"Tweet":"Accountability And Irresponsibility: The Two Faces Of Obama's… https://t.co/YiGpajZGeQ #Accountability #TedKennedy… https://t.co/2e2w2JC4A9","ratings":-1.0},{"Tweet":"Obama's Last Days in Office are Spent 'Trump-Proofing' the Oval Office - Girls Just Wanna Have Guns https://t.co/DdUHyBjh9f","ratings":1.0},{"Tweet":"Young Barack Obama struggles with identity in 'Barry' clip https://t.co/3ZUasDkqP0","ratings":1.0},{"Tweet":"Iran sanctions bill goes into law without Obama's signature https://t.co/tp7rX8Ei1Z","ratings":-1.0},{"Tweet":"Young Barack Obama struggles with identity in 'Barry' clip https://t.co/6hBNhy62uu","ratings":1.0},{"Tweet":"1) Of course I remember and 2) see my pinned tweet. \"Obama/Clinton did it tooooooo!\" is a pathetically unpersuasive… https://t.co/zOW5aGy7ms","ratings":-1.0},{"Tweet":"Ocean Sciences Article of the Day - Obama environmental legacy at stake as GOP, industry align (Washington Post)  https://t.co/zgAkGfcVrc","ratings":1.0},{"Tweet":"Obama signs bill to review northern border threats https://t.co/qd9gb8Pf2C https://t.co/S4EMmknyMk","ratings":-1.0},{"Tweet":"@GianTheAnon absolutely and if Obama was strong others would follow. Only know how to use hashtags for outrage","ratings":-1.0},{"Tweet":"@BlissTabitha we know they're evil plan & so did Obama, that was all part of the hi jack!","ratings":-1.0},{"Tweet":"Obama Leaves Office on High Note, But Public Has Mixed Views of Accompl... https://t.co/OOD86avLfa #politics #news https://t.co/X5bgCsITUR","ratings":1.0},{"Tweet":"So the GOP argued that Obama couldn't fill a Supreme Ct. seat due to his term ending, but is OK with hamstringing the incoming NC governor?","ratings":-1.0},{"Tweet":"#impeachtrump Charges: Treason. Please sign and pass on. Get into House of Rep with Obama in office. Impeach Jan 23… https://t.co/a46nYhWJkF","ratings":1.0},{"Tweet":"Michelle Obama to Host Screening of ‘Hidden Figures’ at the White House https://t.co/ZfqJ8yQq90","ratings":1.0},{"Tweet":"@raymondpirouz You poor, naive, CNN & MSNBC sheltered soul:\n\nhttps://t.co/2eiDeNmpQL\n\nLike I said: \"RANSOM.\"  The current POTUS has #noballs","ratings":-1.0},{"Tweet":"Young Barack Obama struggles with identity in 'Barry' clip https://t.co/rowUtVhpIX https://t.co/v8Q7vE3URP","ratings":1.0},{"Tweet":"Donald Trump Fires Back At Obama For Trying To Delegitimize His Win Why did Obama wait until Hill lost https://t.co/livJZ5kk18","ratings":-1.0},{"Tweet":"@jdb820 @emilcDC That said, perhaps one of those candidates +4 years would work. Obama wasn't ready in 2004.","ratings":-1.0},{"Tweet":"Young Barack Obama struggles with identity in 'Barry' clip https://t.co/xrG2se8nAN Via @RareDivergent https://t.co/x8Qjdvcn5b","ratings":1.0},{"Tweet":"Great info to keep because effort has already begun to credit the great achievements that @realDonaldTrump will mak… https://t.co/5vCdSh9RWG","ratings":1.0},{"Tweet":"@TmarTn Thanks Obama","ratings":-1.0},{"Tweet":"I NEED HELP. WHAT IS OBAMA'S FOREIGN POLICY LEGACY???","ratings":1.0},{"Tweet":"Hagel says Obama figure 75% ISIS fighters killed is useless. \"If we've learned anything from Vietnam... body counts make no sense.\" @CNN","ratings":-1.0},{"Tweet":"@CounterMoonbat @FreeBeacon Andy with his man crush on Obama: \"Parting is such sweet sorrow, that I shall say good night till it be morrow\"","ratings":1.0},{"Tweet":"” —President Obama on rejecting the.","ratings":-1.0},{"Tweet":"Please support this petition Hispanic Immigrants Deserve Rights. Find more we support at our website.\n https://t.co/QwgEIZmSXG via @Change","ratings":1.0},{"Tweet":"@balfeheughlywed @thehill I keep waiting for the breaking news about treason charges or Obama speaking out or congress acting, but, crickets","ratings":-1.0},{"Tweet":"{retweet}College president blames election outcome on ‘racism’ against Obama https://t.co/FdrwzC3TGD","ratings":1.0},{"Tweet":"@FoxNews @IvankaTrump This is great news for our nation, especially women and children. Michelle Obama's legacy? She ruined school lunches!","ratings":-1.0},{"Tweet":"Michelle Obama Reads Children ‘The Night Before Christmas’, Makes Ugly PC Changes https://t.co/CjV0oRBiEF https://t.co/klQcK75w3d","ratings":-1.0},{"Tweet":"Another muslim turncoat traitor. https://t.co/SjxVtlUrHU","ratings":-1.0},{"Tweet":"Obama Accelerates Troop Deployments in Eastern Europe https://t.co/XAmkHBX8SG #thedailybulletin","ratings":-1.0},{"Tweet":"@LouDobbs @seanhannity   @realDonaldTrump the criminal minded #Obama admin is scared to death of a real #DOJ taking over . #PizzaGate #","ratings":-1.0},{"Tweet":"@LarrySchweikart Real question: Even if he was born in another country, his mother was a US citizen. What changes, Obama still a liar.","ratings":1.0},{"Tweet":"Trump Slams “Conspiracy Theory” After John Bolton Suggests Russian Hack Was “False Flag” By Obama Administration https://t.co/Dty8tQxGI0","ratings":-1.0},{"Tweet":"@theblaze   True racism was why Obama wasn't elected this year","ratings":1.0},{"Tweet":"MICHELLE OBAMA DEMANDS AMERICANS PAY UP TO GIVE HER MOM A CUSHY $160K PENSION https://t.co/FHO4XQ6I3d https://t.co/YmQc5jMq7Z","ratings":-1.0},{"Tweet":"@marklevinshow @chucktodd To our benefit to have familiarity with Russian leaders & their danger VS mocking threat like Obama did to Mitt.","ratings":-1.0},{"Tweet":"Trump Slams “Conspiracy Theory” After John Bolton Suggests Russian Hack Was “False Flag” By Obama Administration https://t.co/qViXcMklii","ratings":-1.0},{"Tweet":"Michelle Obama Reads Children ‘The Night Before Christmas’, Makes Ugly PC Changes https://t.co/cAy2mkWiWk https://t.co/XC6VsBWTdG","ratings":-1.0},{"Tweet":"Obama Intelligence Officials Refuse To Brief Congress on \"Russian Hacking Conspiracy\" https://t.co/oALyHBg0wb… https://t.co/NlfNLIGNBa","ratings":-1.0},{"Tweet":"Trump Slams “Conspiracy Theory” After John Bolton Suggests Russian Hack Was “False Flag” By Obama Administration https://t.co/bqiBk3tI5C","ratings":-1.0},{"Tweet":"OBAMA IS P*SSED! CIA JUST CAUGHT IN MASSIVE LIE ABOUT RUSSIAN HACKING!! https://t.co/6ASHPwPodu via @YouTube","ratings":-1.0},{"Tweet":"Obama bars states from pulling Planned Parenthood funding - https://t.co/4YYSjNTP58  #PlannedParenthood @POTUS #news","ratings":-1.0},{"Tweet":"Michelle Obama Reads Children ‘The Night Before Christmas’, Makes Ugly PC Changes https://t.co/2rKU4nFAFN https://t.co/Nuv7eTJpbk","ratings":-1.0},{"Tweet":"Republicans Show True Colors As GOP Views Putin More Favorably Than Obama via @politicususa https://t.co/JRy2h4Fe6i","ratings":1.0},{"Tweet":"NBC News: Putin \"Personally Involved\" in Attack On Our Election\nhttps://t.co/fJPj6SBvV9\nObama must brief country about Russian interference.","ratings":-1.0},{"Tweet":"@NKingofDC @chucktodd Trump busy negotiating with businesses to keep American jobs here. Obama was being drama queen.","ratings":1.0},{"Tweet":"@kjgillenwater we have laws Obama\nWon't follow & BTW we are not a Democracy we are a Republic! https://t.co/QF9Lyw47SR","ratings":1.0},{"Tweet":"@photosandbacon @realDonaldTrump that is the new Obama security vehicle","ratings":1.0},{"Tweet":"Trump Slams “Conspiracy Theory” After John Bolton Suggests Russian Hack Was “False Flag” By Obama Administration https://t.co/XIeVCg2CKy","ratings":-1.0},{"Tweet":"Obama administration files trade challenge against China: WASHINGTON — Amid new tensions with China, the Obama…… https://t.co/n7DGpCMTna","ratings":1.0},{"Tweet":"@NBCNews Obama and his CIA are becoming an international laughing stock.","ratings":1.0},{"Tweet":"Pres. Obama Wrote the Year’s Most Talked-about Science Paper https://t.co/jfVrSe7u9I #thedailybulletin","ratings":-1.0},{"Tweet":"MICHELLE OBAMA DEMANDS AMERICANS PAY UP TO GIVE HER MOM A CUSHY $160K PENSION https://t.co/eUiJXpok7w https://t.co/Xqm0chUSEV","ratings":-1.0},{"Tweet":"13/1776 Articles: Why Obama Could Not Stage a Coup https://t.co/eIjsHO3Ofa","ratings":-1.0},{"Tweet":"MICHELLE OBAMA DEMANDS AMERICANS PAY UP TO GIVE HER MOM A CUSHY $160K PENSION https://t.co/xEKAFeC1zK https://t.co/HWw7ECwiF5","ratings":-1.0},{"Tweet":"Donald Trump Is Daring Us To Stop His Corruption, and Democrats Have A Plan via @thenation https://t.co/yQ0wboZLkq","ratings":1.0},{"Tweet":"#College #president blames #election outcome on ‘racism’ against #Obama - https://t.co/XBpyiRW8yc","ratings":-1.0},{"Tweet":"@CNNPolitics @POTUS @WhiteHouse Obama smart Policy in Syria has stop & break Daesh,Nusra while avoiding another stupid $Trillion Ground War","ratings":-1.0},{"Tweet":"Trump Slams “Conspiracy Theory” After John Bolton Suggests Russian Hack Was “False Flag” By Obama Administration https://t.co/xWWSgVWUWa","ratings":-1.0},{"Tweet":"Remember it's all about his half ass legacy. Nothing potus. https://t.co/J6QKFKdeAE","ratings":1.0},{"Tweet":"@marklevinshow The Obama Administration, what went wrong? https://t.co/EuVYUuSayG","ratings":-1.0},{"Tweet":"Not sure that's the biggest problem there... https://t.co/KRfmHsRxbG","ratings":-1.0},{"Tweet":"@FoxNews With all the money/income envy Obama has fomented over 8 years, there's little wonder that this cabinet doesn't suit many folks!","ratings":1.0},{"Tweet":"Trump Slams “Conspiracy Theory” After John Bolton Suggests Russian Hack Was “False Flag” By Obama Administration https://t.co/yEFYe6p4d4","ratings":-1.0},{"Tweet":"@BernieSanders - wistful thinking Bernie? A majority of Americans elected Barack Obama 2x. McConnell & Co. tried to destroy him.@JoyAnnReid","ratings":1.0},{"Tweet":"@Thenoiregent lol so u are saying Obama was moderate because he was scared to catch a bullet ? C'mon fam","ratings":1.0},{"Tweet":"@claire_s40 @Blackfin109 compared to other modern presidents he's probably second best(after Clinton).Compared to candidate Obama, he's shit","ratings":-1.0},{"Tweet":"@SteveWest_68 @CNN   We have no business there. Obama overthrowing an elected president to appease his Saudi bosses. No wonder BO ez on ISIS","ratings":1.0},{"Tweet":"Obama is Trying Last Push to Pass the UN Arms Trade Treaty--Sends it to Senate https://t.co/j0y0PpAyGW via @regisgiles","ratings":1.0},{"Tweet":"⚡ Obama blocks states from defunding Planned Parenthood\n\nhttps://t.co/7QZ4Qa4XK3","ratings":-1.0},{"Tweet":"@POTUS They will judge you harshly if you don't do something about the #RussiaHacking #Election2016 was invalid. Pl… https://t.co/QoaHNg9YAk","ratings":-1.0},{"Tweet":"Obama Crushed After Trump Orders White House To Stop His Sickest Tradition https://t.co/niPWpqHYUP via @YouTube","ratings":-1.0},{"Tweet":"@Trumpisgonnawin \nit's obama\nLast F off to America","ratings":-1.0},{"Tweet":"Updated: ‘Barry,’ on Netflix, explores a pivotal year in the life of a young Barack Obama https://t.co/5K77UHircK https://t.co/cVj99imhNX","ratings":1.0},{"Tweet":"@RobertaLipp @kurteichenwald @VanityFair You should ask the man whose limp-wristed policy created it: Barack Hussein Obama #Redline","ratings":1.0},{"Tweet":"@theblaze @JonStreet many people who voted Trump also voted for Obama twice. They suddenly became racist","ratings":-1.0},{"Tweet":"Obama's White House 'irresponsible' for claiming Trump 'knew about Russian hacking' - Daily… https://t.co/IQVIPlwFhQ","ratings":1.0},{"Tweet":"#nude obama girl kerala naked videos https://t.co/xXcGOtmjJM","ratings":-1.0},{"Tweet":"Good for President Obama ⚡️ “Obama blocks states from defunding Planned Parenthood”\n\nhttps://t.co/qh9JvgNvH9","ratings":1.0},{"Tweet":"@PressSec It must pay a lot, having to service Obama","ratings":1.0},{"Tweet":"VIDEO : Obama Interfered with the Election When he Told ILLEGALS TO VOTE https://t.co/mg1iPAXmUW","ratings":-1.0},{"Tweet":"Legacies . . .His and Ours. - Yes, Aleppo is Part of Obama's Legacy* * * So now, maybe, it's time to think abou... https://t.co/R5IEmpLTdD","ratings":1.0},{"Tweet":"@Brasilmagic I also love the ones placing the Hurricane Katrina nightmare blame squarely on Barack Obama. When he was an IL state senator.","ratings":-1.0},{"Tweet":"Amazing \n⚡️ “Obama blocks states from defunding Planned Parenthood”\n\nhttps://t.co/FrfjjRF5wH","ratings":1.0},{"Tweet":"He clearly lacks cognitive ability. Why else would he \"need\" his children 2 do everything 4 him? He can't focus or… https://t.co/6lbXQihUxb","ratings":1.0},{"Tweet":"Twitter Mocks The Hell Out Of Trump For Latest Poorly-Spelled Screed Against Obama (TWEETS) https://t.co/z0FADpndce","ratings":-1.0},{"Tweet":"The CIA refused to show up to a House briefing because they are working on the briefing for Obama and the... https://t.co/LBduN2KIfk","ratings":1.0},{"Tweet":"https://t.co/VDSSYCuHU1 #mca Turkey's Erdogan says discussed Syria, Iraq with Obama https://t.co/GKGMHEAfDk","ratings":-1.0},{"Tweet":"Obama Crushed After Trump Orders White House To Stop His Sickest Tradition https://t.co/fv9fIJCAsF via @YouTube","ratings":-1.0},{"Tweet":"Electoral College Scam Against Trump Tied Directly To Obama and Hillary - https://t.co/cV0FcOArJy","ratings":1.0},{"Tweet":"All the Times the Obama Said There Was 'No Military Solution' to Syria W... https://t.co/aukWLwFTBx via @YouTube","ratings":-1.0},{"Tweet":"@squiddlecakes friends but we will not take any shit from anyone👍 and I think our soured relationship with Israel that Obama created will","ratings":-1.0},{"Tweet":"Start with current administration before you attack the man not yet inaugurated. Mr. Obama set the Middle East abla… https://t.co/tqVJs2TSfn","ratings":-1.0},{"Tweet":"Obama Vows To Make Sure My Brother's Keeper Lives On - \"This is something I’ll be invested in for the rest of m... https://t.co/F7n5bFYd3x","ratings":1.0},{"Tweet":"10 Things Obama Doesn't Want Us To Know About His Daughters-- https://t.co/B3AxHGFc96","ratings":-1.0},{"Tweet":"clarionproject #Obama refuses to sign #Iran sanctions bill https://t.co/L2EecTRwfP\n\n#Obama refuses to sign #Iran sanctions bill …","ratings":-1.0},{"Tweet":"Unfortunately for you Trump will on the 20th of January be in charge. \nhttps://t.co/8BHRPWfb10","ratings":1.0},{"Tweet":"@BradReason :SO WHY DON'T THEY IMPEACH HIM!!! & OBAMA IS FORCED TO STAY!!!👍👍👍👍👍👍👍👍👍👍","ratings":-1.0},{"Tweet":"seriously @realDonaldTrump makes this man minister of memes! https://t.co/yvBQ1uTSZr","ratings":-1.0},{"Tweet":"@NKingofDC @bkesling Obama a class act. Do you think I'll ever say the same about Trump? #Doubtful.","ratings":1.0},{"Tweet":"#impeachtrump Charges: Treason. Please sign/pass on. Get into House of Rep with Obama in office. Impeach Jan  23.… https://t.co/lBLAkwP4NI","ratings":1.0},{"Tweet":"Pres. Obama Wrote the Year's Most Talked-about Science Paper https://t.co/Y1hEHIz5n4 #Science @Sciam https://t.co/cqzzG2fhVL","ratings":-1.0},{"Tweet":"Kara Swisher estranged wife, Megan Smith, is Chief Technology Officer to Obama. Oh the minor details.","ratings":1.0},{"Tweet":"That's not how it works snowflake! Pres. Trump will undo All of Obumers EOs. https://t.co/EY5pAJmJFn","ratings":1.0},{"Tweet":"@dadflannels No. But unfair to say that Obama's tenure is unimportant for PoCs in a practical sense because he couldn't fix racism.","ratings":-1.0},{"Tweet":"News flash @POTUS your sorry ass is gone in 6 weeks, see ya https://t.co/EWiWDNTq95","ratings":-1.0},{"Tweet":"Jessie Ventura: Obama's New ISIS Plan is 'Absurd' https://t.co/k5Z6yEFKhZ #ISIS #iraq #war #usa #middle #east #racket","ratings":1.0},{"Tweet":"@miles1365 You sir are pond scum. Malia Obama is attending Harvard. You, more than likely, failed to finish 3rd grade!","ratings":1.0},{"Tweet":"House Freedom Caucus Seeks to Dump Obama Transgender, Nutrition Rules https://t.co/6AJWurNZWz via @educationweek","ratings":1.0},{"Tweet":"@DavidJo52951945 Surely, the gang is included in the people that Obama is going to accept from Australia...","ratings":-1.0},{"Tweet":"@Faisal7HTX Obama is a great man & his legacy will be a great President. And it was about time this country had an African America leader.","ratings":1.0},{"Tweet":"He would know. https://t.co/DcSTxtN1et","ratings":-1.0},{"Tweet":"@fubaglady\n@latinaafortrump\n@vivelafra \nIf Russian claws dug into US politics, Obama — not Trump — let it happen\nhttps://t.co/Fbenp8RMhT","ratings":1.0},{"Tweet":"Read Today's Full Digest Edition:\n—What’s behind the canceled House intel briefing on the Russian hack?\n—Obama’s... https://t.co/LyJvoJiMOq","ratings":-1.0},{"Tweet":"One of Obama's boyfriends no doubt! https://t.co/jv6De7fdhu","ratings":-1.0},{"Tweet":"@RBRNet12 @BockRosweiler @amjoyshow @docrocktex26 read moron. Careful! You might learn something. https://t.co/3o1ZD2mfKX","ratings":1.0},{"Tweet":"Ta-Nehisi Coates discusses the racial barriers President Obama had to overcome. \n►Watch the extended interview:... https://t.co/OznX0iySMi","ratings":1.0},{"Tweet":"Electoral College Scam Against Trump Tied Directly To Obama and Hillary - https://t.co/Tzn49bAt4z","ratings":1.0},{"Tweet":"Donald Trump says 'merry Christmas,' Obama wishes 'happy holidays' https://t.co/tfuw8vzxe0 https://t.co/q2zYk62cRq","ratings":1.0},{"Tweet":"Turkey’s Erdogan says discussed Syria, Iraq with Obama https://t.co/5eeNUmJT8G","ratings":-1.0},{"Tweet":"Donald Trump says 'merry Christmas,' Obama wishes 'happy holidays' https://t.co/dAZWudvVxt https://t.co/WWro9rc4Zi","ratings":1.0},{"Tweet":"@theblaze NO..WHITES ELECTED OBAMA AND WHITES PUT TRUMP IN OFFICE...IT WAS THE DEMS POLICIES AMERICANS HATED...","ratings":1.0},{"Tweet":"Reports: FCC Chairman to step down at the end of Obama's termhttp://www.mynews13.com/content/news/cfnews13/news/art… https://t.co/ZgpzLB4MkJ","ratings":-1.0},{"Tweet":"@retrophys1cal @StillWithHer For all of us. That's the best way to help people to improve this sluggish Obama economy. EVERYONE wins.","ratings":1.0},{"Tweet":"@kickstart526 @koons_rob @CNN you're all going to long for Obama days in the bear future.","ratings":-1.0},{"Tweet":"A2 Politics: My Brother's Keeper: Obama vows to 'stay invested' after he leaves office https://t.co/zRGRW19MsH","ratings":-1.0},{"Tweet":"Breaking: Sheriff Joe Has New Obama Birth Certificate Bombshell WATCH at: https://t.co/8wl5BOxuQY https://t.co/tCYHLSQj23","ratings":1.0},{"Tweet":"@wolfblitzer What a load of BS from Hagel, so now the Mideast too damn many to mention Religious Civil Wars are Oba… https://t.co/HcliCwC01a","ratings":-1.0},{"Tweet":"Donald Trump says 'merry Christmas,' Obama wishes 'happy holidays' https://t.co/ECMtLm1jEU https://t.co/zs6glZkTlb","ratings":1.0},{"Tweet":"#Anonymous \"There would be chaos\": Health care chief issues grave warning to Republicans hoping to dismantle Obama… https://t.co/OoWCjAbjcl","ratings":-1.0},{"Tweet":"Donald Trump says 'merry Christmas,' Obama wishes 'happy holidays' https://t.co/ns024BCEZL https://t.co/LYOEqV8YpC","ratings":1.0},{"Tweet":"Donald Trump says 'merry Christmas,' Obama wishes 'happy holidays' https://t.co/wSVnspruBJ https://t.co/twdLwUlImb","ratings":1.0},{"Tweet":"My last White House visit under the Obama administration was today. Will not be here again for a minute, thanks for everything 😩💙","ratings":1.0},{"Tweet":"No we don't, what if this same joke was made about Obama and his daughters? There'd be blood in the streets with yo… https://t.co/h9MdwErJas","ratings":-1.0},{"Tweet":"@psgamer92 No. Obama is too busy telling #FakeNews stories about Russia.","ratings":-1.0},{"Tweet":"Progressive left will watch all trials unless Obama pardons a boat load of people https://t.co/uZXKn3vjFz","ratings":-1.0},{"Tweet":"Voters in the United States: People United For Michelle Obama in 2020 - Sign the Petition! https://t.co/4HtMLd5JcN","ratings":1.0},{"Tweet":"@LukeBrinker And Obama's? after all, he is responsible for this shit","ratings":-1.0},{"Tweet":"https://t.co/L6W7yJSaQf.\n\nBarack H. Obama\nIslamic dad.😷 https://t.co/zlmju63YhU","ratings":-1.0},{"Tweet":"Turkey’s Erdogan says discussed Syria, Iraq with Obama https://t.co/rHMjNApC3H","ratings":-1.0},{"Tweet":"@JB_Carlson why does obama have multiple id's? wasnt his father a leftist russian communist?  did his mother work for ford foundation?","ratings":-1.0},{"Tweet":"@ScottAdamsSays Barack Obama: Fire the CIA Director - Sign the Petition! https://t.co/4zGc2Dq7SU via @Change","ratings":-1.0},{"Tweet":"#BendOverBarry took it in the a$$ each time 🙄 https://t.co/IrxZQNBCCE","ratings":1.0},{"Tweet":"Donald Trump says 'merry Christmas,' Obama wishes 'happy holidays' https://t.co/Gcli2D9aOg https://t.co/Tsk12uRDj4","ratings":1.0},{"Tweet":"#impeachtrump Charges: Treason. Please sign/pass on. Get into House of  Rep with Obama in office. Impeach Jan   23.… https://t.co/VjyDbBOmj9","ratings":1.0}];